saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32F30x_DFP.1.0.3.pdsc
     <!-- GD32F30x STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F30x STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32F30x Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F30x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="USART"/>
    </condition>
  </conditions>

  <components>
    <!-- GD32F30x_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="ADC" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_adc.c" attr="config" version="1.0.2" />
        </files>
    </component>

   <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="BKP" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Backup register(BKP) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_bkp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_bkp.c" attr="config" version="1.0.2" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="CAN" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_can.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="CRC" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_crc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="CTC" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
        <files>
          <!-- CTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_ctc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_ctc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="DAC" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_dac.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="DBG" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_dbg.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="DMA" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_dma.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="ENET" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Ethernet(ENET) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ENET
        </RTE_Components_h>
        <files>
          <!-- ENET flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_enet.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_enet.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="EXMC" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>External memory controller(EXMC) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
        </RTE_Components_h>
        <files>
          <!-- EXMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_exmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_exmc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="EXTI" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_exti.c" attr="config" version="1.0.2" />
        </files>
    </component>

