saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32F30x_DFP.1.0.3.pdsc
  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="FMC" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_fmc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="FWDGT" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_fwdgt.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="GPIO" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_gpio.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="I2C" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_i2c.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="MISC" Cversion="1.0.2" condition="GD32F30x CMSIS">
      <description>MISC driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_misc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="PMU" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_pmu.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="RCU" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_rcu.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="RTC" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_rtc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="SDIO" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Secure digital input/output interface(SDIO) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_sdio.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_spi.c" attr="config" version="1.0.2" />
        </files>
    </component>

